Ran Plan for dir: `vpc-demo-2` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_internet_gateway.gw will be created
+ resource "aws_internet_gateway" "gw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "Project VPC IGW Demo2"
        }
      + tags_all = {
          + "Name" = "Project VPC IGW Demo2"
        }
      + vpc_id   = "vpc-0458fe504e7f526c7"
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d vpc-demo-2`
* :put_litter_in_its_place: To **delete** this plan click [here](https://180f-100-26-152-126.ngrok.io/lock?id=Pin-Cheng%252Faws-vpc%252Fvpc-demo-2%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d vpc-demo-2`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`